/* eslint-disable prettier/prettier */
/* eslint-disable quotes */
import React from 'react';
import {View, SafeAreaView, Text, StyleSheet, ScrollView} from 'react-native';
import { SCREEN_HEIGHT, SCREEN_WIDTH } from '../constants';

export const UserAgreement = () => {
  return (
    <SafeAreaView style={styles.container}>
      <View style={styles.container}>
        <ScrollView>
          <Text style={styles.mainText} >
          Настоящее Пользовательское соглашение регулирует отношения между ТОО «Med Talk» («MedTalk») и пользователем сети Интернет («Пользователь»), возникающие при использовании интернет-ресурса www.medtalk.kz (medtalk.kz), на указанных в Пользовательском соглашении условиях. К отношениям Пользователей и ТОО «MedTalk», связанных с использованием Сайта medtalk.kz, применяется законодательство Республики Казахстан.
Полным и безоговорочным принятием настоящего соглашения со стороны Пользователя является совершение Пользователем действий, направленных на использование Medtalk.kz, в том числе, просмотр страниц и объявлений, поиск или размещение объявлений, регистрация на сайте, оставление комментариев, направление сообщений через форму связи и прочие действия по использованию функциональности Medtalk.kz.
Пользовательское соглашение может быть изменено MedTalk в любое время без какого-либо специального уведомления Пользователя. Новая редакция Пользовательского соглашения вступает в силу с момента ее размещения на Medtalk.kz, если MedTalk прямо не указано иное. Регулярное ознакомление с действующей редакцией Пользовательского соглашения является обязанностью Пользователя.
Использование Medtalk.kz после вступления в силу новой редакции Пользовательского соглашения означает согласие с ней Пользователя и применение к нему в полном объеме положений новой редакции.
Действующая редакция настоящего Пользовательского соглашения доступна по адресу https://medtalk.kz*****

ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
MedTalk/Собственник Сайта — Товарищество с ограниченной ответственностью «Med Talk», БИН 210440020448, зарегистрированное по адресу: 050043, Республика Казахстан, город Алматы, Бостандыкский район, ул. Навои, 208/1.
Medtalk.kz и (или) Сайт — Интернет ресурс, представляющий собой совокупность содержащихся в информационной системе информации и объектов интеллектуальной собственности (в том числе, программа для ЭВМ, база данных, графическое оформление интерфейса (дизайн) и др.), доступ к которому обеспечивается с различных пользовательских устройств, подключенных к сети Интернет, посредством специального программного обеспечения для просмотра веб-страниц (браузер) по адресам www.medtalk.kz, medtalk.kz и m.medtalk.kz (включая домены следующих уровней, относящихся к данным адресам) или Мобильных приложений Medtalk.kz.
Пользователь — посетитель ресурсов сети Интернет, в том числе Medtalk.kz.
Зарегистрированный пользователь – Пользователь, прошедший процедуру регистрации на Сайте в соответствии с настоящими правилами.
Пользователь–юридическое лицо – категория Пользователей, использующие Сервисы Medtalk.kz в коммерческих целях с особыми возможностями размещения информации о компании (например, клиники, аптеки, производители медицинского оборудования, врачи).
Авторизация на Сайте – процедура идентификации Пользователя для доступа в личный кабинет и к отдельным Сервисам и услугам Сайта.
Учетная запись - совокупность данных, относящихся к конкретному Пользователю, включая информацию о его действиях на Сайте и информацию, предоставленную Пользователем на Сайте.
Сервисы — функциональные возможности, службы, услуги, инструменты, доступные для Пользователей на Medtalk.kz.
Товар — любой товар, продукт, услуга, предложение в отношении которого Пользователь или рекламодатель размещает на Medtalk.kz объявление.
Объявление — информационное сообщение с предложением о Товаре (включая контактную информацию, фотографии и любую сопутствующую информацию), размещаемое Пользователем на Medtalk.kz, адресованное неопределенному кругу лиц.
Правила – Правила использования Сайта и Сервисов Сайта, определенные настоящим пользовательским соглашением, включая приложения, определяющие принципы использования Сайта.
Продавец — зарегистрированный на сайте Medtalk.kz Пользователь, размещающий на Сайте объявление с предложением заключить сделку в отношении Товара.
Покупатель — Пользователь, осуществляющий просмотр размещенного Продавцом объявления, взаимодействие с Продавцом в отношении Товара и (или) заключающий сделку с Продавцом.
Учетные данные — уникальный логин (адрес электронной почты) и пароль, создаваемые самостоятельно Пользователем в процессе Регистрации на Сайте либо измененные в дальнейшем Пользователем через Личный кабинет, используемые для доступа в Личный кабинет для авторизации Пользователя на Medtalk.kz.
Личный кабинет — персональный раздел Пользователя на Medtalk.kz, связанный с учетной записью Пользователя на Сайте, в котором Пользователю доступно управление отдельными Сервисами Medtalk.kz, в том числе их заказ, подключение, отключение, на предложенных MedTalk условиях.
Регистрация — процесс создания Учетной записи Пользователем после предоставления им соответствующих сведений, включая предоставление Учетных данных и иной информации, совершаемых Пользователем с использованием специальной формы пользовательского интерфейса Medtalk.kz, принятия настоящих, в целях формирования учетной записи (Личного кабинета) и получения доступа к отдельным Сервисам Medtalk.kz.
Платные услуги - услуги, предоставляемые Пользователю MedTalk за плату, например, размещение платных Объявлений, просмотр отдельных категорий объявлений и (или) разделов Сайта, услуги на основе абонентской платы (подписки) или по продвижению на Сайте.
Сведения — любые материалы и информация, предоставляемые Пользователем MedTalk в связи с использованием Medtalk.kz.
                  </Text>
        </ScrollView>
      </View>
    </SafeAreaView>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
    marginTop: SCREEN_HEIGHT * 0.01,
      paddingHorizontal: SCREEN_WIDTH * 0.025,
  },
  mainText: {
    fontWeight: '400',
    fontSize: 12,
    lineHeight: 15,
    color: 'rgba(21, 21, 21, 1)',
  },
});
